greeting_message = 'Я бот созданный для обеспечения конфиденциальной отправки\n' \
                   'ваших сообщений пользователям. Никто кроме вас и вашего собеседника\n' \
                   'не будет знать о чем ваши текстовые сообщения.\n' \
                   'Пожалуйста нажмите на кнопку "📄 Описание", что бы ознакомиться с инструкцией.'

description = 'Еще раз приветсвую вас в нашем умном чат-боте,\n' \
              'вот ознакомительная информация для вас, чтобы вы лучше ориентировались и не ошибались.\n' \
              '\n' \
              'С моей помощью вы сможете легко зашифровать ваши сообщения и передать их тому,\n' \
              'с кем хотите скрыть ваше общение. Ваши сообщения будут надежно защещены и расшифровать их\n' \
              'сможете только вы или ваш собеседник при определенных условиях.\n' \
              '\n' \
              'Итак, как это работает:\n' \
              '\n' \
              '1. Чтобы зашифровать ваше сообщение, нажмите на кнопку "🔐 Зашифровать сообщение"\n' \
              'и после напишите текст, который хотите зашифровать. В конце собщения без пробела\n' \
              'поставьте "#", далее так же без пробела введите ключ (любое целое число) и нажмите отправить.\n' \
              'Ваше сообщение будет зашифрованно и вы сможете его переслать своему собеседнику, только не забудте\n' \
              'отправить ему ключ, который вводили иначе он(а) не сможет расшифровать ваше сообщение.\n' \
              'Вот пример зашифрованного сообщения: введенно - Привет мир#3 -> результат - Тулеих плу\n' \
              '\n' \
              '2. Чтобы расшифровать сообщение, нажмите на кнопку "🔓 Расшифровать сообщение"\n' \
              'введите зашифрованное сообщение поставьте "#", укажите ключ полученный от собеседника\n' \
              'и нажмите отправить. Полученное сообщение будет расшифрованно.\n' \
              'Вот пример расшифрованного сообщения: введенно - Тулеих плу#3 -> результат - Привет мир\n' \
              '\n' \
              '3. Шифровать и дешифровать сообщения я могу как на русском так и на английском.\n' \
              '\n' \
              'Мы надеемся, что у вас не возникнет сложностей в использовании бота и вы оцение его функциональность.\n' \
              'Наша цель - обеспечить вам безопасность и удобство при обмене конфиденциальными данными.\n' \
              'Не забывайте хранить ключи для дешифрования в секрете!\n' \
              'Это лишь начальная версия Бота, мы будем совершенствовать его и радовать\n' \
              'Вас новыми обновлениями и фичами!🔐✉️'

shifr_text = 'Напишите Ваш текс для зашифровки в формате ("Сообщение"#4, без кавычек): '
deshifr_text = 'Напишите Ваш текс для расшифровки в формате ("Сообщение"#4, без кавычек): '
